app/controllers/galleries_controller.rb

INSERT INTO "galleries" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 08 Aug 2017 17:23:50 UTC +00:00], ["description", "The road to ruin is shorter than you think"], ["name", "Sorye ge don"], ["updated_at", Tue, 08 Aug 2017 17:23:50 UTC +00:00]]
INSERT INTO "pictures" ("created_at", "gallery_id", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @gallery = Gallery.new(gallery_params)

    respond_to do |format|
      if @gallery.save

        if params[:images]
          params[:images].each { |image|
            @gallery.pictures.create(image: image)